Console.Clear();
// Показать числа от -5 до 5. Показать все числа? или маленький кусочек.

// Правила написания.

// менять имя переменных.
// Название метода должно отражать суть.
// Имя аргумента метода - должно отражать суть.
// Когда дольше читается, чем пишется. 
// // Стараться не использовать сокращения, кроме общепринятых в проекте.
// Не использовать имена, совпадающие с идентификатором.
// Не использовать мат.
// Идентификаторы должны хорошо звучать.
// для наименования переменных не используйте символы и дефисы.
// Не сокращать там, где это не нужно.
// не использовать акронимы. SendPM jor SendPrivateMessage. 
// Использовать в названии сокращения.
// Именование методов, аргументов, переменных должны отличаться. 
// Написание наименований определеятеся нотациями. Паскаль, Кэмел.
// Избегайте длинные строки. Разбивайте длинные строки на несколько мелких (макс 100 символов)
// Форматирование еода.

// Общие правила.
// тип var использовать там, где нужно.
// Объявляем переменную до начала операции.
// Имена счётчиков не нужно выдумывать.
// Цепочки стоят особняком. 
// Системы описывается рядом.
// Комментирование кода нужно, но не каждую строчку.
// Неиспользованный код не комментируйте, а удаляйте.
// Если код временный, используйте ТУДУ. 
// 


